avr-rust/avrd/packs/xmegae/ATxmega32E5.atdf
          </instance>
        </module>
        <module name="RST" id="I6083" version="XMEGAAU">
          <instance name="RST">
            <register-group address-space="data" offset="0x0078" name-in-module="RST" name="RST"/>
          </instance>
        </module>
        <module name="WDT" id="I6078">
          <instance name="WDT">
            <register-group address-space="data" offset="0x0080" name-in-module="WDT" name="WDT"/>
          </instance>
        </module>
        <module name="MCU" id="I6091" version="XMEGAE">
          <instance name="MCU">
            <register-group address-space="data" offset="0x0090" name-in-module="MCU" name="MCU"/>
          </instance>
        </module>
        <module name="PMIC" id="I6057">
          <instance name="PMIC">
            <register-group address-space="data" offset="0x00A0" name-in-module="PMIC" name="PMIC"/>
          </instance>
        </module>
        <module name="PORTCFG" id="I6075" version="XMEGAE">
          <instance name="PORTCFG">
            <register-group address-space="data" offset="0x00B0" name-in-module="PORTCFG" name="PORTCFG"/>
            <signals>
              <signal field="CLKOUT" function="CLKOUTD" group="CLKOUT" pad="PD7"/>
              <signal field="CLKEVPIN" function="CLKOUTD_ALT" group="CLKOUT" pad="PD4"/>
              <signal field="CLKOUT" function="CLKOUTR" group="CLKOUT" pad="PR0"/>
              <signal field="EVOUT" function="EVOUTD" group="EVOUT" pad="PD7"/>
              <signal field="CLKEVPIN" function="EVOUTD_ALT" group="EVOUT" pad="PD4"/>
              <signal field="EVOUT" function="EVOUTR" group="EVOUT" pad="PR0"/>
              <signal field="RTCOUT" function="RTCOUTD" group="RTCOUT" pad="PD6"/>
              <signal field="RTCOUT" function="RTCOUTR" group="RTCOUT" pad="PR0"/>
            </signals>
          </instance>
        </module>
        <module name="CRC" id="I6111" version="XMEGAAU">
          <instance name="CRC">
            <register-group address-space="data" offset="0x0D0" name-in-module="CRC" name="CRC"/>
          </instance>
        </module>
        <module name="EDMA" id="I3002" version="XMEGAE">
          <instance name="EDMA">
            <register-group address-space="data" offset="0x0100" name-in-module="EDMA" name="EDMA"/>
          </instance>
        </module>
        <module name="EVSYS" id="I6061" version="XMEGAE">
          <instance name="EVSYS">
            <register-group address-space="data" offset="0x0180" name-in-module="EVSYS" name="EVSYS"/>
          </instance>
        </module>
        <module name="NVM" id="I3620" version="XMEGAE">
          <instance name="NVM">
            <register-group address-space="data" offset="0x01C0" name-in-module="NVM" name="NVM"/>
          </instance>
        </module>
        <module name="ADC" id="I6110" version="XMEGAE">
          <instance name="ADCA">
            <register-group address-space="data" offset="0x0200" name-in-module="ADC" name="ADCA"/>
            <signals>
              <signal function="ADC" group="ADC" index="0" pad="PA0"/>
              <signal function="ADC" group="ADC" index="1" pad="PA1"/>
              <signal function="ADC" group="ADC" index="2" pad="PA2"/>
              <signal function="ADC" group="ADC" index="3" pad="PA3"/>
              <signal function="ADC" group="ADC" index="4" pad="PA4"/>
              <signal function="ADC" group="ADC" index="5" pad="PA5"/>
              <signal function="ADC" group="ADC" index="6" pad="PA6"/>
              <signal function="ADC" group="ADC" index="7" pad="PA7"/>
              <signal function="ADC" group="ADC" index="8" pad="PD0"/>
              <signal function="ADC" group="ADC" index="9" pad="PD1"/>
              <signal function="ADC" group="ADC" index="10" pad="PD2"/>
              <signal function="ADC" group="ADC" index="11" pad="PD3"/>
              <signal function="ADC" group="ADC" index="12" pad="PD4"/>
              <signal function="ADC" group="ADC" index="13" pad="PD5"/>
              <signal function="ADC" group="ADC" index="14" pad="PD6"/>
              <signal function="ADC" group="ADC" index="15" pad="PD7"/>
              <signal function="AREF" group="REFA" index="0" pad="PA0"/>
              <signal function="AREF" group="REFD" index="0" pad="PD0"/>
            </signals>
          </instance>
        </module>
        <module name="DAC" id="I6059" version="XMEGAAU">
          <instance name="DACA">
            <register-group address-space="data" offset="0x0300" name-in-module="DAC" name="DACA"/>
            <signals>
              <signal function="DAC" group="DAC" index="0" pad="PA2"/>
              <signal function="DAC" group="DAC" index="1" pad="PA3"/>
              <signal function="AREF" group="REFA" index="0" pad="PA0"/>
              <signal function="AREF" group="REFD" index="0" pad="PD0"/>
            </signals>
          </instance>
        </module>
        <module name="AC" id="I6077" version="XMEGAE">
          <instance name="ACA">
            <register-group address-space="data" offset="0x0380" name-in-module="AC" name="ACA"/>
            <signals>
              <signal function="AC" group="AC" index="0" pad="PA0"/>
              <signal function="AC" group="AC" index="1" pad="PA1"/>
              <signal function="AC" group="AC" index="2" pad="PA2"/>
              <signal function="AC" group="AC" index="3" pad="PA3"/>
              <signal function="AC" group="AC" index="4" pad="PA4"/>
              <signal function="AC" group="AC" index="5" pad="PA5"/>
              <signal function="AC" group="AC" index="6" pad="PA6"/>
              <signal function="AC" group="AC" index="7" pad="PA7"/>
              <signal field="ACOUT" function="ACOUT_PA" group="ACOUT" index="1" pad="PA6"/>
              <signal field="ACOUT" function="ACOUT_PA" group="ACOUT" index="0" pad="PA7"/>
              <signal field="ACOUT" function="ACOUT_PC" group="ACOUT" index="1" pad="PC6"/>
              <signal field="ACOUT" function="ACOUT_PC" group="ACOUT" index="0" pad="PC7"/>
              <signal field="ACOUT" function="ACOUT_PD" group="ACOUT" index="1" pad="PD6"/>
              <signal field="ACOUT" function="ACOUT_PD" group="ACOUT" index="0" pad="PD7"/>
              <signal field="ACOUT" function="ACOUT_PR" group="ACOUT" index="1" pad="PR0"/>
              <signal field="ACOUT" function="ACOUT_PR" group="ACOUT" index="0" pad="PR1"/>
            </signals>
          </instance>
        </module>
        <module name="RTC" id="I6093" version="XMEGAE">
          <instance name="RTC">
            <register-group address-space="data" offset="0x0400" name-in-module="RTC" name="RTC"/>
