avr-rust/avrd/packs/xmegae/ATxmega32E5.atdf
      <value-group caption="Event Output Port" name="PORTCFG_EVOUT">
        <value caption="Event Output Disabled" name="OFF" value="0x00"/>
        <value caption="Event Channel n Output on Port C pin 7" name="PC7" value="0x01"/>
        <value caption="Event Channel n Output on Port D pin 7" name="PD7" value="0x02"/>
        <value caption="Event Channel n Output on Port R pin 0" name="PR0" value="0x03"/>
      </value-group>
      <value-group caption="Event Output Select" name="PORTCFG_EVOUTSEL">
        <value caption="Event Channel 0 output to pin" name="0" value="0x00"/>
        <value caption="Event Channel 1 output to pin" name="1" value="0x01"/>
        <value caption="Event Channel 2 output to pin" name="2" value="0x02"/>
        <value caption="Event Channel 3 output to pin" name="3" value="0x03"/>
        <value caption="Event Channel 4 output to pin" name="4" value="0x04"/>
        <value caption="Event Channel 5 output to pin" name="5" value="0x05"/>
        <value caption="Event Channel 6 output to pin" name="6" value="0x06"/>
        <value caption="Event Channel 7 output to pin" name="7" value="0x07"/>
      </value-group>
    </module>
    <module name="CRC" id="I6111" version="XMEGAAU" caption="Cyclic Redundancy Checker">
      <register-group caption="Cyclic Redundancy Checker" name="CRC" size="8">
        <register caption="Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Reset" mask="0xC0" name="RESET" values="CRC_RESET"/>
          <bitfield caption="CRC Mode" mask="0x20" name="CRC32"/>
          <bitfield caption="Input Source" mask="0x0F" name="SOURCE" values="CRC_SOURCE"/>
        </register>
        <register caption="Status Register" name="STATUS" offset="0x01" size="1">
          <bitfield caption="Zero detection" mask="0x02" name="ZERO"/>
          <bitfield caption="Busy" mask="0x01" name="BUSY"/>
        </register>
        <register caption="Data Input" name="DATAIN" offset="0x03" size="1"/>
        <register caption="Checksum byte 0" name="CHECKSUM0" offset="0x04" size="1"/>
        <register caption="Checksum byte 1" name="CHECKSUM1" offset="0x05" size="1"/>
        <register caption="Checksum byte 2" name="CHECKSUM2" offset="0x06" size="1"/>
        <register caption="Checksum byte 3" name="CHECKSUM3" offset="0x07" size="1"/>
      </register-group>
      <value-group caption="Reset" name="CRC_RESET">
        <value caption="No Reset" name="NO" value="0x00"/>
        <value caption="Reset CRC with CHECKSUM to all zeros" name="RESET0" value="0x02"/>
        <value caption="Reset CRC with CHECKSUM to all ones" name="RESET1" value="0x03"/>
      </value-group>
      <value-group caption="Input Source" name="CRC_SOURCE">
        <value caption="Disabled" name="DISABLE" value="0x00"/>
        <value caption="I/O Interface" name="IO" value="0x01"/>
        <value caption="Flash" name="FLASH" value="0x02"/>
        <value caption="DMAC Channel 0" name="DMAC0" value="0x04"/>
        <value caption="DMAC Channel 1" name="DMAC1" value="0x05"/>
        <value caption="DMAC Channel 2" name="DMAC2" value="0x06"/>
        <value caption="DMAC Channel 3" name="DMAC3" value="0x07"/>
      </value-group>
    </module>
    <module name="EDMA" id="I3002" version="XMEGAE" caption="Enhanced DMA Controller">
      <register-group caption="Enhanced DMA Controller" name="EDMA" size="80">
        <register caption="Control" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Enable" mask="0x80" name="ENABLE"/>
          <bitfield caption="Software Reset" mask="0x40" name="RESET"/>
          <bitfield caption="Channel Mode" mask="0x30" name="CHMODE" values="EDMA_CHMODE"/>
          <bitfield caption="Double Buffer Mode" mask="0x0C" name="DBUFMODE" values="EDMA_DBUFMODE"/>
          <bitfield caption="Priority Mode" mask="0x03" name="PRIMODE" values="EDMA_PRIMODE"/>
        </register>
        <register caption="Transfer Interrupt Status" name="INTFLAGS" offset="0x03" size="1">
          <bitfield caption="Channel 3 Transaction Error Interrupt Flag" mask="0x80" name="CH3ERRIF"/>
          <bitfield caption="Channel 2 Transaction Error Interrupt Flag" mask="0x40" name="CH2ERRIF"/>
          <bitfield caption="Channel 1 Transaction Error Interrupt Flag" mask="0x20" name="CH1ERRIF"/>
          <bitfield caption="Channel 0 Transaction Error Interrupt Flag" mask="0x10" name="CH0ERRIF"/>
          <bitfield caption="Channel 3 Transaction Complete Interrupt Flag" mask="0x08" name="CH3TRNFIF"/>
          <bitfield caption="Channel 2 Transaction Complete Interrupt Flag" mask="0x04" name="CH2TRNFIF"/>
          <bitfield caption="Channel 1 Transaction Complete Interrupt Flag" mask="0x02" name="CH1TRNFIF"/>
          <bitfield caption="Channel 0 Transaction Complete Interrupt Flag" mask="0x01" name="CH0TRNFIF"/>
        </register>
        <register caption="Status" name="STATUS" offset="0x04" size="1">
          <bitfield caption="Channel 3 Busy Flag" mask="0x80" name="CH3BUSY"/>
          <bitfield caption="Channel 2 Busy Flag" mask="0x40" name="CH2BUSY"/>
          <bitfield caption="Channel 1 Busy Flag" mask="0x20" name="CH1BUSY"/>
          <bitfield caption="Channel 0 Busy Flag" mask="0x10" name="CH0BUSY"/>
          <bitfield caption="Channel 3 Pending Flag" mask="0x08" name="CH3PEND"/>
          <bitfield caption="Channel 2 Pending Flag" mask="0x04" name="CH2PEND"/>
          <bitfield caption="Channel 1 Pending Flag" mask="0x02" name="CH1PEND"/>
          <bitfield caption="Channel 0 Pending Flag" mask="0x01" name="CH0PEND"/>
        </register>
        <register caption="Temporary Register For 16-bit Access" name="TEMP" offset="0x06" size="1"/>
        <register-group caption="EDMA Channel 0" name="CH0" offset="0x10" name-in-module="EDMA_CH"/>
        <register-group caption="EDMA Channel 1" name="CH1" offset="0x20" name-in-module="EDMA_CH"/>
        <register-group caption="EDMA Channel 2" name="CH2" offset="0x30" name-in-module="EDMA_CH"/>
        <register-group caption="EDMA Channel 3" name="CH3" offset="0x40" name-in-module="EDMA_CH"/></register-group>
      <register-group caption="EDMA Channel" name="EDMA_CH" size="16">
        <register caption="Channel Control A" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="Channel Enable" mask="0x80" name="ENABLE"/>
          <bitfield caption="Channel Software Reset" mask="0x40" name="RESET"/>
          <bitfield caption="Channel Repeat Mode" mask="0x20" name="REPEAT"/>
          <bitfield caption="Channel Transfer Request" mask="0x10" name="TRFREQ"/>
          <bitfield caption="Channel Single Shot Data Transfer" mask="0x04" name="SINGLE"/>
          <bitfield caption="Channel 2-bytes Burst Length" mask="0x01" name="BURSTLEN"/>
        </register>
        <register caption="Channel Control" name="CTRLB" offset="0x01" size="1">
          <bitfield caption="Channel Block Transfer Busy" mask="0x80" name="CHBUSY"/>
          <bitfield caption="Channel Block Transfer Pending" mask="0x40" name="CHPEND"/>
          <bitfield caption="Channel Transaction Error Interrupt Flag" mask="0x20" name="ERRIF"/>
          <bitfield caption="Channel Transaction Complete Interrup Flag" mask="0x10" name="TRNIF"/>
          <bitfield caption="Channel Transaction Error Interrupt Level" mask="0x0C" name="ERRINTLVL" values="EDMA_CH_INTLVL"/>
          <bitfield caption="Channel Transaction Complete Interrupt Level" mask="0x03" name="TRNINTLVL" values="EDMA_CH_INTLVL"/>
        </register>
        <register caption="Memory Address Control for Peripheral Ch., or Source Address Control for Standard Ch." name="ADDRCTRL" offset="0x02" size="1">
          <bitfield caption="Memory Address Reload for Peripheral Ch., or Source Address Reload for Standard Ch." mask="0x30" name="RELOAD" values="EDMA_CH_RELOAD"/>
          <bitfield caption="Memory Address Mode for Peripheral Ch., or Source Address Mode for Standard Ch." mask="0x07" name="DIR" values="EDMA_CH_DIR"/>
        </register>
        <register caption="Destination Address Control for Standard Channels Only." name="DESTADDRCTRL" offset="0x03" size="1">
          <bitfield caption="Destination Address Reload for Standard Channels Only." mask="0x30" name="DESTRELOAD" values="EDMA_CH_RELOAD"/>
          <bitfield caption="Destination Address Mode for Standard Channels Only." mask="0x07" name="DESTDIR" values="EDMA_CH_DESTDIR"/>
        </register>
        <register caption="Channel Trigger Source" name="TRIGSRC" offset="0x04" size="1">
          <bitfield caption="Channel Trigger Source" mask="0xFF" name="TRIGSRC" values="EDMA_CH_TRIGSRC"/>
        </register>
        <register caption="Channel Block Transfer Count for Peripheral Ch., or Channel Block Transfer Count Low for Standard Ch." name="TRFCNT" offset="0x06" size="2"/>
        <register caption="Channel Memory Address for Peripheral Ch., or Channel Source Address Low for Standard Ch." name="ADDR" offset="0x08" size="2"/>
        <register caption="Channel Destination Address for Standard Channels Only." name="DESTADDR" offset="0x0C" size="2"/>
      </register-group>
      <value-group caption="Channel mode" name="EDMA_CHMODE">
        <value caption="Channels 0, 1, 2 and 3 in peripheal conf." name="PER0123" value="0x00"/>
        <value caption="Channel 0 in standard conf.; channels 2 and 3 in peripheral conf." name="STD0" value="0x01"/>
        <value caption="Channel 2 in standard conf.; channels 0 and 1 in peripheral conf." name="STD2" value="0x02"/>
        <value caption="Channels 0 and 2 in standard conf." name="STD02" value="0x03"/>
      </value-group>
      <value-group caption="Double buffer mode" name="EDMA_DBUFMODE">
        <value caption="No double buffer enabled" name="DISABLE" value="0x00"/>
        <value caption="Double buffer enabled on peripheral channels 0/1 (if exist) " name="BUF01" value="0x01"/>
        <value caption="Double buffer enabled on peripheral channels 2/3 (if exist)" name="BUF23" value="0x02"/>
        <value caption="Double buffer enabled on peripheral channels 0/1 and 2/3 or standard channels 0/2" name="BUF0123" value="0x03"/>
      </value-group>
      <value-group caption="Priority mode" name="EDMA_PRIMODE">
        <value caption="Round robin on all channels" name="RR0123" value="0x00"/>
        <value caption="Ch0 &gt; round robin (Ch 1 ch2 Ch3)" name="RR123" value="0x01"/>
        <value caption="Ch0 &gt; Ch 1 &gt; round robin (Ch2 Ch3)" name="RR23" value="0x02"/>
        <value caption="Ch0 &gt; Ch1 &gt; Ch2 &gt; Ch3 " name="CH0123" value="0x03"/>
      </value-group>
      <value-group caption="Memory Address Reload for Peripheral Ch., or Source Address Reload for Standard Ch." name="EDMA_CH_RELOAD">
        <value caption="No reload" name="NONE" value="0x00"/>
        <value caption="Reload at end of each block transfer" name="BLOCK" value="0x01"/>
        <value caption="Reload at end of each burst transfer" name="BURST" value="0x02"/>
        <value caption="Reload at end of each transaction" name="TRANSACTION" value="0x03"/>
      </value-group>
      <value-group caption="Memory Address Mode for Peripheral Ch., or Source Address Mode for Standard Ch." name="EDMA_CH_DIR">
        <value caption="Fixed" name="FIXED" value="0x00"/>
        <value caption="Increment" name="INC" value="0x01"/>
        <value caption="If Peripheral Ch. (Per ==&gt; Mem), 1-byte 'mask-match' (data: ADDRL, mask: ADDRH), else reserved conf. " name="MP1" value="0x04"/>
        <value caption="If Peripheral Ch. (Per ==&gt; Mem), 1-byte 'OR-match' (data-1: ADDRL OR data-2: ADDRH), else reserved conf. " name="MP2" value="0x05"/>
        <value caption="If Peripheral Ch. (Per ==&gt; Mem), 2-byte 'match' (data-1: ADDRL followed by data-2: ADDRH), else reserved conf. " name="MP3" value="0x06"/>
      </value-group>
      <value-group caption="Destination addressing mode" name="EDMA_CH_DESTDIR">
        <value caption="Fixed" name="FIXED" value="0x00"/>
        <value caption="Increment" name="INC" value="0x01"/>
        <value caption="1-byte 'mask-match' (data: ADDRL, mask: ADDRH)" name="MP1" value="0x04"/>
        <value caption="1-byte 'OR-match' (data-1: ADDRL OR data-2: ADDRH)" name="MP2" value="0x05"/>
        <value caption="2-byte 'match' (data1: ADDRL followed by data2: ADDRH)" name="MP3" value="0x06"/>
      </value-group>
