avr-rust/avrd/packs/xmegae/ATxmega32E5.atdf
      <value-group caption="Transfer trigger source" name="EDMA_CH_TRIGSRC">
        <value caption="Software triggers only" name="OFF" value="0x00"/>
        <value caption="Event CH0 as trigger (Standard Channels Only)" name="EVSYS_CH0" value="0x01"/>
        <value caption="Event CH1 as trigger (Standard Channels Only)" name="EVSYS_CH1" value="0x02"/>
        <value caption="Event CH2 as trigger (Standard Channels Only)" name="EVSYS_CH2" value="0x03"/>
        <value caption="ADCA CH0 as trigger" name="ADCA_CH0" value="0x10"/>
        <value caption="DACA CH0 as trigger" name="DACA_CH0" value="0x15"/>
        <value caption="DACA CH1 as trigger" name="DACA_CH1" value="0x16"/>
        <value caption="TCC4 overflow/underflow as trigger (Standard Channels Only)" name="TCC4_OVF" value="0x40"/>
        <value caption="TCC4 error as trigger (Standard Channels Only)" name="TCC4_ERR" value="0x41"/>
        <value caption="TCC4 compare or capture channel A as trigger (Standard Channels Only)" name="TCC4_CCA" value="0x42"/>
        <value caption="TCC4 compare or capture channel B as trigger (Standard Channels Only)" name="TCC4_CCB" value="0x43"/>
        <value caption="TCC4 compare or capture channel C as trigger (Standard Channels Only)" name="TCC4_CCC" value="0x44"/>
        <value caption="TCC4 compare or capture channel D as trigger (Standard Channels Only)" name="TCC4_CCD" value="0x45"/>
        <value caption="TCC5 overflow/underflow as trigger (Standard Channels Only)" name="TCC5_OVF" value="0x46"/>
        <value caption="TCC5 error as trigger (Standard Channels Only)" name="TCC5_ERR" value="0x47"/>
        <value caption="TCC5 compare or capture channel A as trigger (Standard Channels Only)" name="TCC5_CCA" value="0x48"/>
        <value caption="TCC5 compare or capture channel B as trigger (Standard Channels Only)" name="TCC5_CCB" value="0x49"/>
        <value caption="SPI C transfer complete (SPI Standard Mode) or SPI C receive complete as trigger (SPI Buffer Modes)" name="SPIC_RXC" value="0x4A"/>
        <value caption="SPI C transfer complete (SPI Standard Mode) or SPI C data register empty as trigger (SPI Buffer modes)" name="SPIC_DRE" value="0x4B"/>
        <value caption="USART C0 receive complete as trigger" name="USARTC0_RXC" value="0x4C"/>
        <value caption="USART C0 data register empty as trigger" name="USARTC0_DRE" value="0x4D"/>
        <value caption="TCD5 overflow/underflow as trigger (Standard Channels Only)" name="TCD5_OVF" value="0x66"/>
        <value caption="TCD5 error as trigger (Standard Channels Only)" name="TCD5_ERR" value="0x67"/>
        <value caption="TCD5 compare or capture channel A as trigger (Standard Channels Only)" name="TCD5_CCA" value="0x68"/>
        <value caption="TCD5 compare or capture channel B as trigger (Standard Channels Only)" name="TCD5_CCB" value="0x69"/>
        <value caption="USART D0 receive complete as trigger" name="USARTD0_RXC" value="0x6C"/>
        <value caption="USART D0 data register empty as trigger" name="USARTD0_DRE" value="0x6D"/>
      </value-group>
      <value-group caption="Interrupt level" name="EDMA_CH_INTLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>
      <interrupt-group name="EDMA">
        <interrupt index="0" name="CH0" caption="EDMA Channel 0 Interrupt"/>
        <interrupt index="1" name="CH1" caption="EDMA Channel 1 Interrupt"/>
        <interrupt index="2" name="CH2" caption="EDMA Channel 2 Interrupt"/>
        <interrupt index="3" name="CH3" caption="EDMA Channel 3 Interrupt"/>
      </interrupt-group>
    </module>
    <module name="EVSYS" id="I6061" version="XMEGAE" caption="Event System">
      <register-group caption="Event System" name="EVSYS" size="19">
        <register caption="Event Channel 0 Multiplexer" name="CH0MUX" offset="0x00" size="1">
          <bitfield caption="Event Channel 0 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 1 Multiplexer" name="CH1MUX" offset="0x01" size="1">
          <bitfield caption="Event Channel 1 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 2 Multiplexer" name="CH2MUX" offset="0x02" size="1">
          <bitfield caption="Event Channel 2 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 3 Multiplexer" name="CH3MUX" offset="0x03" size="1">
          <bitfield caption="Event Channel 3 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 4 Multiplexer" name="CH4MUX" offset="0x04" size="1">
          <bitfield caption="Event Channel 4 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 5 Multiplexer" name="CH5MUX" offset="0x05" size="1">
          <bitfield caption="Event Channel 5 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 6 Multiplexer" name="CH6MUX" offset="0x06" size="1">
          <bitfield caption="Event Channel 6 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Event Channel 7 Multiplexer" name="CH7MUX" offset="0x07" size="1">
          <bitfield caption="Event Channel 7 Multiplexer" mask="0xFF" name="CHMUX" values="EVSYS_CHMUX"/>
        </register>
        <register caption="Channel 0 Control Register" name="CH0CTRL" offset="0x08" size="1">
          <bitfield caption="Rotary Decoder Enable" mask="0x80" name="ROTARY"/>
          <bitfield caption="Quadrature Decoder Index Recognition Mode" mask="0x60" name="QDIRM" values="EVSYS_QDIRM"/>
          <bitfield caption="Quadrature Decoder Index Enable" mask="0x10" name="QDIEN"/>
          <bitfield caption="Quadrature Decoder Enable" mask="0x08" name="QDEN"/>
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
