avr-rust/avrd/packs/xmegae/ATxmega32E5.atdf
        <register caption="Current Source Calibration Register" name="CURRCALIB" offset="0x09" size="1">
          <bitfield caption="Current Source Calibration" mask="0x0F" name="CALIB"/>
        </register>
      </register-group>
      <value-group caption="Interrupt mode" name="AC_INTMODE">
        <value caption="Interrupt on both edges" name="BOTHEDGES" value="0x00"/>
        <value caption="Interrupt on falling edge" name="FALLING" value="0x02"/>
        <value caption="Interrupt on rising edge" name="RISING" value="0x03"/>
      </value-group>
      <value-group caption="Interrupt level" name="AC_INTLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Hysteresis mode selection" name="AC_HYSMODE">
        <value caption="No hysteresis" name="NO" value="0x00"/>
        <value caption="Small hysteresis" name="SMALL" value="0x01"/>
        <value caption="Large hysteresis" name="LARGE" value="0x02"/>
      </value-group>
      <value-group caption="Positive input multiplexer selection" name="AC_MUXPOS">
        <value caption="Pin 0" name="PIN0" value="0x00"/>
        <value caption="Pin 1" name="PIN1" value="0x01"/>
        <value caption="Pin 2" name="PIN2" value="0x02"/>
        <value caption="Pin 3" name="PIN3" value="0x03"/>
        <value caption="Pin 4" name="PIN4" value="0x04"/>
        <value caption="Pin 5" name="PIN5" value="0x05"/>
        <value caption="Pin 6" name="PIN6" value="0x06"/>
        <value caption="DAC output" name="DAC" value="0x07"/>
      </value-group>
      <value-group caption="Negative input multiplexer selection" name="AC_MUXNEG">
        <value caption="Pin 0" name="PIN0" value="0x00"/>
        <value caption="Pin 1" name="PIN1" value="0x01"/>
        <value caption="Pin 3" name="PIN3" value="0x02"/>
        <value caption="Pin 5" name="PIN5" value="0x03"/>
        <value caption="Pin 7" name="PIN7" value="0x04"/>
        <value caption="DAC output" name="DAC" value="0x05"/>
        <value caption="Bandgap Reference" name="BANDGAP" value="0x06"/>
        <value caption="Internal voltage scaler" name="SCALER" value="0x07"/>
      </value-group>
      <value-group caption="Windows interrupt mode" name="AC_WINTMODE">
        <value caption="Interrupt on above window" name="ABOVE" value="0x00"/>
        <value caption="Interrupt on inside window" name="INSIDE" value="0x01"/>
        <value caption="Interrupt on below window" name="BELOW" value="0x02"/>
        <value caption="Interrupt on outside window" name="OUTSIDE" value="0x03"/>
      </value-group>
      <value-group caption="Window interrupt level" name="AC_WINTLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low priority" name="LO" value="0x01"/>
        <value caption="Medium priority" name="MED" value="0x02"/>
        <value caption="High priority" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Window mode state" name="AC_WSTATE">
        <value caption="Signal above window" name="ABOVE" value="0x00"/>
        <value caption="Signal inside window" name="INSIDE" value="0x01"/>
        <value caption="Signal below window" name="BELOW" value="0x02"/>
      </value-group>
      <interrupt-group name="AC">
        <interrupt index="0" name="AC0" caption="AC0 Interrupt"/>
        <interrupt index="1" name="AC1" caption="AC1 Interrupt"/>
        <interrupt index="2" name="ACW" caption="ACW Window Mode Interrupt"/>
      </interrupt-group>
    </module>
    <module name="RTC" id="I6093" version="XMEGAE" caption="Real-Time Clounter">
      <register-group caption="Real-Time Counter" name="RTC" size="14">
        <register caption="Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Correction Enable" mask="0x08" name="CORREN"/>
          <bitfield caption="Prescaling Factor" mask="0x07" name="PRESCALER" values="RTC_PRESCALER"/>
        </register>
        <register caption="Status Register" name="STATUS" offset="0x01" size="1">
          <bitfield caption="Synchronization Busy Flag" mask="0x01" name="SYNCBUSY"/>
        </register>
        <register caption="Interrupt Control Register" name="INTCTRL" offset="0x02" size="1">
          <bitfield caption="Compare Match Interrupt Level" mask="0x0C" name="COMPINTLVL" values="RTC_COMPINTLVL"/>
          <bitfield caption="Overflow Interrupt Level" mask="0x03" name="OVFINTLVL" values="RTC_OVFINTLVL"/>
        </register>
        <register caption="Interrupt Flags" name="INTFLAGS" offset="0x03" size="1">
          <bitfield caption="Compare Match Interrupt Flag" mask="0x02" name="COMPIF"/>
          <bitfield caption="Overflow Interrupt Flag" mask="0x01" name="OVFIF"/>
        </register>
        <register caption="Temporary register" name="TEMP" offset="0x04" size="1"/>
        <register caption="Calibration Register" name="CALIB" offset="0x06" size="1">
          <bitfield caption="Correction Sign" mask="0x80" name="SIGN"/>
          <bitfield caption="Error Value" mask="0x7F" name="ERROR"/>
        </register>
        <register caption="Count Register" name="CNT" offset="0x08" size="2"/>
        <register caption="Period Register" name="PER" offset="0x0A" size="2"/>
        <register caption="Compare Register" name="COMP" offset="0x0C" size="2"/>
      </register-group>
      <value-group caption="Prescaler Factor" name="RTC_PRESCALER">
        <value caption="RTC Off" name="OFF" value="0x00"/>
        <value caption="RTC Clock" name="DIV1" value="0x01"/>
        <value caption="RTC Clock / 2" name="DIV2" value="0x02"/>
        <value caption="RTC Clock / 8" name="DIV8" value="0x03"/>
        <value caption="RTC Clock / 16" name="DIV16" value="0x04"/>
        <value caption="RTC Clock / 64" name="DIV64" value="0x05"/>
        <value caption="RTC Clock / 256" name="DIV256" value="0x06"/>
        <value caption="RTC Clock / 1024" name="DIV1024" value="0x07"/>
      </value-group>
