avr-rust/avrd/packs/xmegae/ATxmega32E5.atdf
      <interrupt-group name="TWI">
        <interrupt index="0" name="TWIS" caption="TWI Slave Interrupt"/>
        <interrupt index="1" name="TWIM" caption="TWI Master Interrupt"/>
      </interrupt-group>
    </module>
    <module name="PORT" id="I6075" version="XMEGAE" caption="Port Configuration">
      <register-group caption="I/O Ports" name="PORT" size="24">
        <register caption="I/O Port Data Direction" name="DIR" offset="0x00" size="1"/>
        <register caption="I/O Port Data Direction Set" name="DIRSET" offset="0x01" size="1"/>
        <register caption="I/O Port Data Direction Clear" name="DIRCLR" offset="0x02" size="1"/>
        <register caption="I/O Port Data Direction Toggle" name="DIRTGL" offset="0x03" size="1"/>
        <register caption="I/O Port Output" name="OUT" offset="0x04" size="1"/>
        <register caption="I/O Port Output Set" name="OUTSET" offset="0x05" size="1"/>
        <register caption="I/O Port Output Clear" name="OUTCLR" offset="0x06" size="1"/>
        <register caption="I/O Port Output Toggle" name="OUTTGL" offset="0x07" size="1"/>
        <register caption="I/O port Input" name="IN" offset="0x08" size="1"/>
        <register caption="Interrupt Control Register" name="INTCTRL" offset="0x09" size="1">
          <bitfield caption="Port Interrupt Level" mask="0x03" name="INTLVL" values="PORT_INTLVL"/>
        </register>
        <register caption="Port Interrupt Mask" name="INTMASK" offset="0x0A" size="1"/>
        <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x0C" size="1">
          <bitfield caption="Pin 7 Interrupt Flag" mask="0x80" name="INT7IF"/>
          <bitfield caption="Pin 6 Interrupt Flag" mask="0x40" name="INT6IF"/>
          <bitfield caption="Pin 5 Interrupt Flag" mask="0x20" name="INT5IF"/>
          <bitfield caption="Pin 4 Interrupt Flag" mask="0x10" name="INT4IF"/>
          <bitfield caption="Pin 3 Interrupt Flag" mask="0x08" name="INT3IF"/>
          <bitfield caption="Pin 2 Interrupt Flag" mask="0x04" name="INT2IF"/>
          <bitfield caption="Pin 1 Interrupt Flag" mask="0x02" name="INT1IF"/>
          <bitfield caption="Pin 0 Interrupt Flag" mask="0x01" name="INT0IF"/>
        </register>
        <register caption="Pin Remap Register" name="REMAP" offset="0x0E" size="1">
          <bitfield caption="Usart0" mask="0x10" name="USART0"/>
          <bitfield caption="Timer/Counter 4 Output Compare D" mask="0x08" name="TC4D"/>
          <bitfield caption="Timer/Counter 4 Output Compare C" mask="0x04" name="TC4C"/>
          <bitfield caption="Timer/Counter 4 Output Compare B" mask="0x02" name="TC4B"/>
          <bitfield caption="Timer/Counter 4 Output Compare A" mask="0x01" name="TC4A"/>
        </register>
        <register caption="Pin 0 Control Register" name="PIN0CTRL" offset="0x10" size="1">
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 1 Control Register" name="PIN1CTRL" offset="0x11" size="1">
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 2 Control Register" name="PIN2CTRL" offset="0x12" size="1">
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 3 Control Register" name="PIN3CTRL" offset="0x13" size="1">
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 4 Control Register" name="PIN4CTRL" offset="0x14" size="1">
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 5 Control Register" name="PIN5CTRL" offset="0x15" size="1">
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 6 Control Register" name="PIN6CTRL" offset="0x16" size="1">
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 7 Control Register" name="PIN7CTRL" offset="0x17" size="1">
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
      </register-group>
      <value-group caption="Port Interrupt Level" name="PORT_INTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Output/Pull Configuration" name="PORT_OPC">
        <value caption="Totempole" name="TOTEM" value="0x00"/>
        <value caption="Totempole w/ Bus keeper on Input and Output" name="BUSKEEPER" value="0x01"/>
        <value caption="Totempole w/ Pull-down on Input" name="PULLDOWN" value="0x02"/>
        <value caption="Totempole w/ Pull-up on Input" name="PULLUP" value="0x03"/>
        <value caption="Wired OR" name="WIREDOR" value="0x04"/>
        <value caption="Wired AND" name="WIREDAND" value="0x05"/>
        <value caption="Wired OR w/ Pull-down" name="WIREDORPULL" value="0x06"/>
        <value caption="Wired AND w/ Pull-up" name="WIREDANDPULL" value="0x07"/>
      </value-group>
      <value-group caption="Input/Sense Configuration" name="PORT_ISC">
        <value caption="Sense Both Edges" name="BOTHEDGES" value="0x00"/>
        <value caption="Sense Rising Edge" name="RISING" value="0x01"/>
        <value caption="Sense Falling Edge" name="FALLING" value="0x02"/>
        <value caption="Sense Level (Transparent For Events)" name="LEVEL" value="0x03"/>
        <value caption="Digital Input Buffer Forced Enable" name="FORCE_ENABLE" value="0x06"/>
        <value caption="Disable Digital Input Buffer" name="INPUT_DISABLE" value="0x07"/>
      </value-group>
      <interrupt-group name="PORT">
        <interrupt index="0" name="INT" caption="External Interrupt"/>
      </interrupt-group>
    </module>
    <module name="TC" id="I3007" version="XMEGAE" caption="16-bit Timer/Counter With PWM">
      <register-group caption="16-bit Timer/Counter 4" name="TC4" size="64">
        <register caption="Control  Register A" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="Synchronization Enabled" mask="0x40" name="SYNCHEN"/>
          <bitfield caption="Start on Next Event" mask="0x20" name="EVSTART"/>
          <bitfield caption="Stop on Next Update" mask="0x10" name="UPSTOP"/>
          <bitfield caption="Clock Select" mask="0x0F" name="CLKSEL" values="TC45_CLKSEL"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
          <bitfield caption="Byte Mode" mask="0xC0" name="BYTEM" values="TC45_BYTEM"/>
          <bitfield caption="Circular Buffer Enable" mask="0x30" name="CIRCEN" values="TC45_CIRCEN"/>
          <bitfield caption="Waveform Generation Mode" mask="0x07" name="WGMODE" values="TC45_WGMODE"/>
        </register>
