avr-rust/avrd/packs/xmegae/ATxmega32E5.atdf
        <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x0C" size="1">
          <bitfield caption="Channel D Compare or Capture Interrupt Flag" mask="0x80" name="CCDIF"/>
          <bitfield caption="Channel C Compare or Capture Interrupt Flag" mask="0x40" name="CCCIF"/>
          <bitfield caption="Channel B Compare or Capture Interrupt Flag" mask="0x20" name="CCBIF"/>
          <bitfield caption="Channel A Compare or Capture Interrupt Flag" mask="0x10" name="CCAIF"/>
          <bitfield caption="Trigger Restart Interrupt Flag" mask="0x04" name="TRGIF"/>
          <bitfield caption="Error Interrupt Flag" mask="0x02" name="ERRIF"/>
          <bitfield caption="Overflow/Underflow Interrupt Flag" mask="0x01" name="OVFIF"/>
          <bitfield caption="Channel Low D Compare or Capture Interrupt Flag" mask="0x80" name="LCCDIF"/>
          <bitfield caption="Channel Low C Compare or Capture Interrupt Flag" mask="0x40" name="LCCCIF"/>
          <bitfield caption="Channel Low B Compare or Capture Interrupt Flag" mask="0x20" name="LCCBIF"/>
          <bitfield caption="Channel Low A Compare or Capture Interrupt Flag" mask="0x10" name="LCCAIF"/>
        </register>
        <register caption="Temporary Register For 16-bit Access" name="TEMP" offset="0x0F" size="1"/>
        <register caption="Count" name="CNT" offset="0x20" size="2"/>
        <register caption="Period" name="PER" offset="0x26" size="2"/>
        <register caption="Compare or Capture A" name="CCA" offset="0x28" size="2"/>
        <register caption="Compare or Capture B" name="CCB" offset="0x2A" size="2"/>
        <register caption="Compare or Capture C" name="CCC" offset="0x2C" size="2"/>
        <register caption="Compare or Capture D" name="CCD" offset="0x2E" size="2"/>
        <register caption="Period Buffer" name="PERBUF" offset="0x36" size="2"/>
        <register caption="Compare Or Capture A Buffer" name="CCABUF" offset="0x38" size="2"/>
        <register caption="Compare Or Capture B Buffer" name="CCBBUF" offset="0x3A" size="2"/>
        <register caption="Compare Or Capture C Buffer" name="CCCBUF" offset="0x3C" size="2"/>
        <register caption="Compare Or Capture D Buffer" name="CCDBUF" offset="0x3E" size="2"/>
      </register-group>
      <register-group caption="16-bit Timer/Counter 5" name="TC5" size="64">
        <register caption="Control  Register A" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="Synchronization Enabled" mask="0x40" name="SYNCHEN"/>
          <bitfield caption="Start on Next Event" mask="0x20" name="EVSTART"/>
          <bitfield caption="Stop on Next Update" mask="0x10" name="UPSTOP"/>
          <bitfield caption="Clock Select" mask="0x0F" name="CLKSEL" values="TC45_CLKSEL"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
          <bitfield caption="Byte Mode" mask="0xC0" name="BYTEM" values="TC45_BYTEM"/>
          <bitfield caption="Circular Buffer Enable" mask="0x30" name="CIRCEN" values="TC45_CIRCEN"/>
          <bitfield caption="Waveform Generation Mode" mask="0x07" name="WGMODE" values="TC45_WGMODE"/>
        </register>
        <register caption="Control register C" name="CTRLC" offset="0x02" size="1">
          <bitfield caption="Channel B Output Polarity" mask="0x20" name="POLB"/>
          <bitfield caption="Channel A Output Polarity" mask="0x10" name="POLA"/>
          <bitfield caption="Channel B Compare Output Value" mask="0x02" name="CMPB"/>
          <bitfield caption="Channel A Compare Output Value" mask="0x01" name="CMPA"/>
          <bitfield caption="High Channel B Compare Output Value" mask="0x20" name="HCMPB"/>
          <bitfield caption="High Channel A Compare Output Value" mask="0x10" name="HCMPA"/>
          <bitfield caption="Low Channel B Compare Output Value" mask="0x02" name="LCMPB"/>
          <bitfield caption="Low Channel A Compare Output Value" mask="0x01" name="LCMPA"/>
        </register>
        <register caption="Control Register D" name="CTRLD" offset="0x03" size="1">
          <bitfield caption="Event Action" mask="0xE0" name="EVACT" values="TC45_EVACT"/>
          <bitfield caption="Event Delay" mask="0x10" name="EVDLY"/>
          <bitfield caption="Event Source Select" mask="0x0F" name="EVSEL" values="TC45_EVSEL"/>
        </register>
        <register caption="Control Register E" name="CTRLE" offset="0x04" size="1">
          <bitfield caption="Channel B Compare or Capture Mode" mask="0x0C" name="CCBMODE" values="TC45_CCBMODE"/>
          <bitfield caption="Channel A Compare or Capture Mode" mask="0x03" name="CCAMODE" values="TC45_CCAMODE"/>
          <bitfield caption="Channel Low B Compare or Capture Mode" mask="0x0C" name="LCCBMODE" values="TC45_LCCBMODE"/>
          <bitfield caption="Channel Low A Compare or Capture Mode" mask="0x03" name="LCCAMODE" values="TC45_LCCAMODE"/>
        </register>
        <register caption="Control Register F" name="CTRLF" offset="0x05" size="1">
          <bitfield caption="Channel High B Compare or Capture Mode" mask="0x0C" name="HCCBMODE" values="TC45_HCCBMODE"/>
          <bitfield caption="Channel High A Compare or Capture Mode" mask="0x03" name="HCCAMODE" values="TC45_HCCAMODE"/>
        </register>
        <register caption="Interrupt Control Register A" name="INTCTRLA" offset="0x06" size="1">
          <bitfield caption="Timer Trigger Restart Interrupt Level" mask="0x30" name="TRGINTLVL" values="TC45_TRGINTLVL"/>
          <bitfield caption="Timer Error Interrupt Level" mask="0x0C" name="ERRINTLVL" values="TC45_ERRINTLVL"/>
          <bitfield caption="Timer Overflow/Underflow Interrupt Level" mask="0x03" name="OVFINTLVL" values="TC45_OVFINTLVL"/>
        </register>
        <register caption="Interrupt Control Register B" name="INTCTRLB" offset="0x07" size="1">
          <bitfield caption="Channel B Compare or Capture Interrupt Level" mask="0x0C" name="CCBINTLVL" values="TC45_CCBINTLVL"/>
          <bitfield caption="Channel A Compare or Capture Interrupt Level" mask="0x03" name="CCAINTLVL" values="TC45_CCAINTLVL"/>
          <bitfield caption="Channel Low B Compare or Capture Interrupt Level" mask="0x0C" name="LCCBINTLVL" values="TC45_LCCBINTLVL"/>
          <bitfield caption="Channel Low A Compare or Capture Interrupt Level" mask="0x03" name="LCCAINTLVL" values="TC45_LCCAINTLVL"/>
        </register>
        <register caption="Control Register G Clear" name="CTRLGCLR" offset="0x08" size="1">
          <bitfield caption="Timer/Counter Stop" mask="0x20" name="STOP"/>
          <bitfield caption="Command" mask="0x0C" name="CMD" values="TC45_CMD"/>
          <bitfield caption="Lock Update" mask="0x02" name="LUPD"/>
          <bitfield caption="Counter Direction" mask="0x01" name="DIR"/>
        </register>
