avr-rust/avrd/packs/xmegae/ATxmega32E5.atdf
      <value-group caption="XCL LUT Action" name="USART_LUTACT">
        <value caption="Standard Frame Configuration" name="OFF" value="0x00"/>
        <value caption="Receiver Decoding Enabled" name="RX" value="0x01"/>
        <value caption="Transmitter Encoding Enabled" name="TX" value="0x02"/>
        <value caption="Both Encoding and Decoding Enabled" name="BOTH" value="0x03"/>
      </value-group>
      <value-group caption="XCL Peripheral Counter Action" name="USART_PECACT">
        <value caption="Standard Mode" name="OFF" value="0x00"/>
        <value caption="Variable Data Lenght in Reception" name="PEC0" value="0x01"/>
        <value caption="Variable Data Lenght in Transmission" name="PEC1" value="0x02"/>
        <value caption="Variable Data Lenght in both Reception and Transmission" name="PERC01" value="0x03"/>
      </value-group>
      <interrupt-group name="USART">
        <interrupt index="0" name="RXC" caption="Reception Complete Interrupt"/>
        <interrupt index="1" name="DRE" caption="Data Register Empty Interrupt"/>
        <interrupt index="2" name="TXC" caption="Transmission Complete Interrupt"/>
      </interrupt-group>
    </module>
    <module name="SPI" id="I6090" version="XMEGAE" caption="Serial Peripheral Interface">
      <register-group caption="Serial Peripheral Interface with Buffer Modes" name="SPI" size="5">
        <register caption="Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Enable Double Speed" mask="0x80" name="CLK2X"/>
          <bitfield caption="Enable SPI Module" mask="0x40" name="ENABLE"/>
          <bitfield caption="Data Order Setting" mask="0x20" name="DORD"/>
          <bitfield caption="Master Operation Enable" mask="0x10" name="MASTER"/>
          <bitfield caption="SPI Mode" mask="0x0C" name="MODE" values="SPI_MODE"/>
          <bitfield caption="Prescaler" mask="0x03" name="PRESCALER" values="SPI_PRESCALER"/>
        </register>
        <register caption="Interrupt Control Register" name="INTCTRL" offset="0x01" size="1">
          <bitfield caption="Receive Complete Interrupt Enable (In Buffer Modes Only)." mask="0x80" name="RXCIE"/>
          <bitfield caption="Transmit Complete Interrupt Enable (In Buffer Modes Only)." mask="0x40" name="TXCIE"/>
          <bitfield caption="Data Register Empty Interrupt Enable (In Buffer Modes Only)." mask="0x20" name="DREIE"/>
          <bitfield caption="Slave Select Trigger Interrupt Enable (In Buffer Modes Only)." mask="0x10" name="SSIE"/>
          <bitfield caption="Interrupt level" mask="0x03" name="INTLVL" values="SPI_INTLVL"/>
        </register>
        <register caption="Status Register" name="STATUS" offset="0x02" size="1">
          <bitfield caption="Interrupt Flag (In Standard Mode Only)." mask="0x80" name="IF"/>
          <bitfield caption="Receive Complete Interrupt Flag (In Buffer Modes Only)." mask="0x80" name="RXCIF"/>
          <bitfield caption="Write Collision Flag (In Standard Mode Only)." mask="0x40" name="WRCOL"/>
          <bitfield caption="Transmit Complete Interrupt Flag (In Buffer Modes Only)." mask="0x40" name="TXCIF"/>
          <bitfield caption="Data Register Empty Interrupt Flag (In Buffer Modes Only)." mask="0x20" name="DREIF"/>
          <bitfield caption="Slave Select Trigger Interrupt Flag (In Buffer Modes Only)." mask="0x10" name="SSIF"/>
          <bitfield caption="Buffer Overflow (In Buffer Modes Only)." mask="0x01" name="BUFOVF"/>
        </register>
        <register caption="Data Register" name="DATA" offset="0x03" size="1"/>
        <register caption="Control Register B" name="CTRLB" offset="0x04" size="1">
          <bitfield caption="Buffer Modes" mask="0xC0" name="BUFMODE" values="SPI_BUFMODE"/>
          <bitfield caption="Slave Select Disable" mask="0x04" name="SSD"/>
        </register>
      </register-group>
      <value-group caption="SPI Mode" name="SPI_MODE">
        <value caption="SPI Mode 0, base clock at &quot;0&quot;, sampling on leading edge (rising) &amp; set-up on trailling edge (falling)." name="0" value="0x00"/>
        <value caption="SPI Mode 1, base clock at &quot;0&quot;, set-up on leading edge (rising) &amp; sampling on trailling edge (falling)." name="1" value="0x01"/>
        <value caption="SPI Mode 2, base clock at &quot;1&quot;, sampling on leading edge (falling) &amp; set-up on trailling edge (rising)." name="2" value="0x02"/>
        <value caption="SPI Mode 3, base clock at &quot;1&quot;, set-up on leading edge (falling) &amp; sampling on trailling edge (rising)." name="3" value="0x03"/>
      </value-group>
      <value-group caption="Prescaler setting" name="SPI_PRESCALER">
        <value caption="If CLK2X=1 CLKper/2, else (CLK2X=0) CLKper/4." name="DIV4" value="0x00"/>
        <value caption="If CLK2X=1 CLKper/8, else (CLK2X=0) CLKper/16." name="DIV16" value="0x01"/>
        <value caption="If CLK2X=1 CLKper/32, else (CLK2X=0) CLKper/64." name="DIV64" value="0x02"/>
        <value caption="If CLK2X=1 CLKper/64, else (CLK2X=0) CLKper/128." name="DIV128" value="0x03"/>
      </value-group>
      <value-group caption="Interrupt level" name="SPI_INTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Buffer Modes" name="SPI_BUFMODE">
        <value caption="SPI Unbuffered Mode" name="OFF" value="0x00"/>
        <value caption="Buffer Mode 1 (with dummy byte)" name="BUFMODE1" value="0x02"/>
        <value caption="Buffer Mode 2 (no dummy byte)" name="BUFMODE2" value="0x03"/>
      </value-group>
      <interrupt-group name="SPI">
        <interrupt index="0" name="INT" caption="SPI Interrupt"/>
      </interrupt-group>
    </module>
    <module name="IRCOM" id="I6090" version="XMEGAAU" caption="IR Communication Module">
      <register-group caption="IR Communication Module" name="IRCOM" size="3">
        <register caption="Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Event Channel Select" mask="0x0F" name="EVSEL" values="IRDA_EVSEL"/>
        </register>
