avr-rust/avrd/packs/xmegae/ATxmega32E5.atdf
        <register caption="IrDA Transmitter Pulse Length Control Register" name="TXPLCTRL" offset="0x01" size="1"/>
        <register caption="IrDA Receiver Pulse Length Control Register" name="RXPLCTRL" offset="0x02" size="1"/>
      </register-group>
      <value-group caption="Event channel selection" name="IRDA_EVSEL">
        <value caption="No Event Source" name="OFF" value="0x00"/>
        <value caption="Event Channel 0" name="0" value="0x08"/>
        <value caption="Event Channel 1" name="1" value="0x09"/>
        <value caption="Event Channel 2" name="2" value="0x0A"/>
        <value caption="Event Channel 3" name="3" value="0x0B"/>
        <value caption="Event Channel 4" name="4" value="0x0C"/>
        <value caption="Event Channel 5" name="5" value="0x0D"/>
        <value caption="Event Channel 6" name="6" value="0x0E"/>
        <value caption="Event Channel 7" name="7" value="0x0F"/>
      </value-group>
    </module>
    <module name="FUSE" id="I3620" version="XMEGAE" caption="Fuses and Lockbits">
      <register-group caption="Lock Bits" name="NVM_LOCKBITS" size="1">
        <register caption="Lock Bits" name="LOCKBITS" offset="0x00" size="1">
          <bitfield caption="Boot Lock Bits - Boot Section" mask="0xC0" name="BLBB" values="FUSE_BLBB"/>
          <bitfield caption="Boot Lock Bits - Application Section" mask="0x30" name="BLBA" values="FUSE_BLBA"/>
          <bitfield caption="Boot Lock Bits - Application Table" mask="0x0C" name="BLBAT" values="FUSE_BLBAT"/>
          <bitfield caption="Lock Bits" mask="0x03" name="LB" values="FUSE_LB"/>
        </register>
      </register-group>
      <register-group caption="Fuses" name="NVM_FUSES" size="7">
        <register caption="Watchdog Configuration" name="FUSEBYTE1" offset="0x01" size="1">
          <bitfield caption="Watchdog Window Timeout Period" mask="0xF0" name="WDWP" values="WD"/>
          <bitfield caption="Watchdog Timeout Period" mask="0x0F" name="WDP" values="WD"/>
        </register>
        <register caption="Reset Configuration" name="FUSEBYTE2" offset="0x02" size="1">
          <bitfield caption="Boot Loader Section Reset Vector" mask="0x40" name="BOOTRST" values="BOOTRST"/>
          <bitfield caption="BOD Operation in Power-Down Mode" mask="0x03" name="BODPD" values="BOD"/>
        </register>
        <register caption="Start-up Configuration" name="FUSEBYTE4" offset="0x04" size="1">
          <bitfield caption="External Reset Disable" mask="0x10" name="RSTDISBL"/>
          <bitfield caption="Start-up Time" mask="0x0C" name="SUT" values="SUT"/>
          <bitfield caption="Watchdog Timer Lock" mask="0x02" name="WDLOCK"/>
        </register>
        <register caption="EESAVE and BOD Level" name="FUSEBYTE5" offset="0x05" size="1">
          <bitfield caption="BOD Operation in Active Mode" mask="0x30" name="BODACT" values="BOD"/>
          <bitfield caption="Preserve EEPROM Through Chip Erase" mask="0x08" name="EESAVE"/>
          <bitfield caption="Brownout Detection Voltage Level" mask="0x07" name="BODLVL" values="BODLVL"/>
        </register>
        <register caption="Fault State" name="FUSEBYTE6" offset="0x06" size="1">
          <bitfield caption="Fault Dectection Action on TC5" mask="0x80" name="FDACT5"/>
          <bitfield caption="Fault Dectection Action on TC4" mask="0x40" name="FDACT4"/>
          <bitfield caption="Port Pin Value" mask="0x3F" name="VALUE"/>
        </register>
      </register-group>
      <value-group caption="Boot lock bits - boot setcion" name="FUSE_BLBB">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
      <value-group caption="Boot lock bits - application section" name="FUSE_BLBA">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
      <value-group caption="Boot lock bits - application table section" name="FUSE_BLBAT">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
      <value-group caption="Lock bits" name="FUSE_LB">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
      <value-group caption="Boot Loader Section Reset Vector" name="BOOTRST">
        <value caption="Boot Loader Reset" name="BOOTLDR" value="0x00"/>
        <value caption="Application Reset" name="APPLICATION" value="0x01"/>
      </value-group>
      <value-group caption="BOD operation" name="BOD">
        <value caption="BOD enabled in sampled mode" name="SAMPLED" value="0x01"/>
        <value caption="BOD enabled continuously" name="CONTINUOUS" value="0x02"/>
        <value caption="BOD Disabled" name="DISABLED" value="0x03"/>
      </value-group>
      <value-group caption="Watchdog (Window) Timeout Period" name="WD">
        <value caption="8 cycles (8ms @ 3.3V)" name="8CLK" value="0x00"/>
        <value caption="16 cycles (16ms @ 3.3V)" name="16CLK" value="0x01"/>
        <value caption="32 cycles (32ms @ 3.3V)" name="32CLK" value="0x02"/>
        <value caption="64 cycles (64ms @ 3.3V)" name="64CLK" value="0x03"/>
        <value caption="128 cycles (0.125s @ 3.3V)" name="128CLK" value="0x04"/>
        <value caption="256 cycles (0.25s @ 3.3V)" name="256CLK" value="0x05"/>
        <value caption="512 cycles (0.5s @ 3.3V)" name="512CLK" value="0x06"/>
        <value caption="1K cycles (1s @ 3.3V)" name="1KCLK" value="0x07"/>
        <value caption="2K cycles (2s @ 3.3V)" name="2KCLK" value="0x08"/>
        <value caption="4K cycles (4s @ 3.3V)" name="4KCLK" value="0x09"/>
        <value caption="8K cycles (8s @ 3.3V)" name="8KCLK" value="0x0A"/>
      </value-group>
      <value-group caption="Start-up Time" name="SUT">
        <value caption="0 ms" name="0MS" value="0x03"/>
        <value caption="4 ms" name="4MS" value="0x01"/>
        <value caption="64 ms" name="64MS" value="0x00"/>
      </value-group>
